# Несмещённая Ковариация

import numpy as np
import matplotlib.pyplot as plt

p = np.array ([1.2, 1.6, 1.8, 1.8, 2.5, 2.6, 3. , 3.3])
print(p)
s = np.array([27, 37, 42, 48, 57, 56, 77, 88])
print(s)

print(np.cov(p,s, ddof=1))
# array=([[0.53928571,  14.55714286],  # кавориация
#         [14.55714286 413.71428571]])

print(np.std(p, ddof=1)) # 0.7343607521414215 стандартное отклонение

print(np.std(s, ddof=1)) # 20.339967692065926  стандартное отклонение

print(np.corrcoef(p,s))   # [[1.        0.9745776]  коэф корреляции ПИРСОНА
#                         #  [0.9745776 1.       ]]
# 14.55714286/ (0.7343607521414215 * 20.339967692065926) = 0.9785768206878758