# Несмещённая Ковариация

import numpy as np
import matplotlib.pyplot as plt

p 
array=([1.2, 1.6, 1.8, 1.8, 2.5, 2.6, 3. , 3.3])
s
array=([27, 37, 42, 48, 57, 56, 77, 88])

np.cov(p,s ddof=1)

array=([[0.53928571,  13.32857143],  # кавориация
        [13.32857143, 344.      ]])

np.std(p, ddof=1) # 0.7343607521414215 стандартное отклонение

np.std(s, ddof=1) # 18.547236990991408  стандартное отклонение
                    
13.32857143/ (0.7343607521414215 * 18.547236990991408) = 0.9785768206878758  # коэф корреляции ПИРСОНА

print(np.corrcoef(p,s))   # ([[1.          0.97857682]  корреляция Пирсона
                         #   [0.97857682, 1.        ]])