# Cмещённая Ковариация

import numpy as np
import matplotlib.pyplot as plt

p = np.array ([1.2, 1.6, 1.8, 1.8, 2.5, 2.6, 3. , 3.3])
print(p)
s = np.array([27, 37, 42, 48, 57, 56, 77, 88])
print(s)

print(np.cov(p,s, ddof=0))  # кавориация
# array=([[ 0.471875,  12.7375  ],
#         [12.7375   362.      ]])

print(np.std(p, ddof=0)) # 0.6869315832017042  стандартное отклонение
  
print(np.std(s, ddof=0)) # 19.026297590440446  стандартное отклонение

print(np.corrcoef(p,s))   # [[1.        0.9745776]  коэф корреляции ПИРСОНА
#                         #  [0.97857682, 1.        ]]
# 12.7375 / (0.6869315832017042 * 19.026297590440446) = 0.9785768205829909