# Cмещённая Ковариация

import numpy as np
import matplotlib.pyplot as plt

p 
array=([1.2, 1.6, 1.8, 1.8, 2.5, 2.6, 3. , 3.3])
s
array=([27, 37, 42, 48, 57, 56, 77, 88])

np.cov(p,s ddof=0)  # кавориация

array=([[ 0.471875,  11.6625  ],
        [11.6625   , 301.     ]])

np.std(p, ddof=0) # 0.6869315832017042  стандартное отклонение
  
np.std(s, ddof=0) # 17.349351572897472  стандартное отклонение
                    
11.6625/ (0.6869315832017042 * 17.349351572897472) = 0.9785768205829909 # коэф корреляции ПИРСОНА

print(np.corrcoef(p,s))   # ([[1.          0.97857682]  корреляция Пирсона
                         #   [0.97857682, 1.        ]])