# Матричный метод расчета коэффициентов линейной регрессии
    #  𝑦 = b0+b1x
    #  Y = X * B
    # (y_1  y_2  y_3  ) = (1 x_1  1 x_2  1 x_3  ) (β_0  β_1  )
    #  B = (X**T*X)**-1*X**T*Y

import numpy as np
import scipy.stats as stats

s = np.array([27, 37, 42, 48, 57, 56, 77, 80])
p = np.array([1.2, 1.6, 1.8, 1.8, 2.5, 2.6, 3, 3.3])
x = s.reshape((8,1))
print(x)    # [[27]
            #  [37]
            #  [42]
            #  [48]
            #  [57]
            #  [56]
            #  [77]
            #  [80]]
y = p.reshape((8,1))
print(y)    # [[1.2]
            #  [1.6]
            #  [1.8]
            #  [1.8]
            #  [2.5]
            #  [2.6]
            #  [3. ]
            #  [3.3]]
X = np.hstack([np.ones((8,1)),x])  
# hstack - соединяем по горизонтали (добавляем столбец 1 по горизонтали)
# np.ones - сщздаём 8 единиц (1)
print(X)    # [[ 1. 27.]
            # [ 1. 37.]
            # [ 1. 42.]
            # [ 1. 48.]
            # [ 1. 57.]
            # [ 1. 56.]
            # [ 1. 77.]
            # [ 1. 80.]]
B = np.dot(np.linalg.inv(np.dot(X.T,X)), X.T @ y)
# dot - перемножение матриц и векторов
# inv - нахождение обратной матрицы этого произведения
# X.T @ y - домножение на транспонируюмую матрицу X и y
print(B) # [[0.1714701 ]
         #  [0.03874585]]






