# Даны квартальные прибыли акции Johnson&Johnson с 1960-1980 гг
# Есть ли различия прибыли между 4-мя кварталами?
# Провести EDA (проверка на нормальность, проверка на однородность дисперсий с помощью Барлетт теста
# Учитывайте при выборе теста тот факт, что при сбалансированных данных (выборки одинакового объема),
# неоднородность дисперсий слабо влияет на результат)

import numpy as np
import scipy.stats as stats
from scipy.stats.morestats import shapiro
from scipy.stats import bartlett

JJ_1=np.array([0.71, 0.63, 0.85, 0.44, 0.61, 0.69, 0.92, 0.55, 0.72, 0.77, 0.92, 0.60, 0.83, 0.80, 1.00, 0.77, 0.92, 1.00, 1.24, 1.00, 1.16 ])
JJ_2=np.array([1.30, 1.45, 1.25, 1.26, 1.38, 1.86, 1.56, 1.53, 1.59, 1.83, 1.86, 1.53, 2.07, 2.34, 2.25, 2.16, 2.43, 2.70, 2.25, 2.79, 3.42 ])
JJ_3=np.array([3.69, 3.60, 3.60, 4.32, 4.32, 4.05, 4.86, 5.04, 5.04, 4.41, 5.58, 5.85, 6.57, 5.31, 6.03, 6.39, 6.93, 5.85, 6.93, 7.74, 7.83])
JJ_4=np.array([6.12, 7.74, 8.91, 8.28, 6.84, 9.54, 10.26, 9.54, 8.73, 11.88, 12.06, 12.15, 8.91, 14.04, 12.96, 14.85, 9.99, 16.20, 14.67, 16.02, 11.61 ])

print(stats.shapiro(JJ_4))
# ShapiroResult(statistic=0.9590807557106018, pvalue=0.49780404567718506) 
  
print(stats.bartlett(JJ_1, JJ_2, JJ_3, JJ_4))
# BartlettResult(statistic=109.62893110687119, pvalue=1.3188378332498392e-23)

print(stats.f_oneway(JJ_1, JJ_2, JJ_3, JJ_4))
# F_onewayResult(statistic=162.03157448390618, pvalue=6.813074435306209e-34) 