# Средние расходы на обследование одного больного до ознакомления с расходами коллег
# X= np.array([20,17, 14, 42, 50, 62, 8, 49, 81, 54, 48, 55, 56])
# Y= np.array ([20, 26, 1, 24, 1, 47, 15, 7, 65, 9, 21, 36, 30])
# Средние расходы на лечение одного больного до ознакомления с расходами коллег
# X= np.array([ 32, 41, 51, 29, 76, 47, 60, 58, 40, 64, 73, 66, 73])
# Y= np.array ([42, 90, 71, 47, 56, 43, 137, 63, 28, 60, 87, 69, 50])
# Произошли ли изменения на расходы и лечение?

import numpy as np
import scipy.stats as stats

X= np.array([20,17, 14, 42, 50, 62, 8, 49, 81, 54, 48, 55, 56])
Y= np.array ([20, 26, 1, 24, 1, 47, 15, 7, 65, 9, 21, 36, 30])
print(stats.wilcoxon(X, Y))    # WilcoxonResult(statistic=3.0, pvalue=0.004741768038406971)

X= np.array([ 32, 41, 51, 29, 76, 47, 60, 58, 40, 64, 73, 66, 73])
Y= np.array ([42, 90, 71, 47, 56, 43, 137, 63, 28, 60, 87, 69, 50])
print(stats.wilcoxon(X, Y))    # WilcoxonResult(statistic=31.5, pvalue=0.339599609375)

# до   после   Delta   Ранг       # до   после   Delta   Ранг  Сумма(рангов)  Сумма(рангов)
# 20     20      0                # 32     42      10      5
# 17     26      9      2         # 41     90      49      12
# 14     1      -13               # 51     71      20 !    10      !
# 42     24     -18               # 29     47      18      8       9,5
# 50     1      -49               # 76     56    !-20 !    9       !            9,5
# 62     47     -15               # 47     43    !-4 !     3     !              2,5
# 8      15       7      1        # 60     137     77      13      
# 49     7      -42               # 58     63      5       4     2,5
# 81     65     -16               # 40     28    !-12      6                    6
# 54     9      -45               # 64     60    !-4 !     2     !              2,5
# 48     21     -47               # 73     87      14      7       
# 55     36     -19               # 66     69      3       1
# 56     30     -26               # 73     50    !-23      11                   11
#                       =3                                        = 9,556       = 31,5